insd47/Drunksafe/firmware/sdkconfig.defaults
# ESP32 DevKitC V4 uses the classic ESP32 chip.
CONFIG_IDF_TARGET="esp32"

# The MVP ships as a single image without OTA slots. Reserve enough flash for BLE and Korean UI assets.
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# Rust often needs more main task stack than the ESP-IDF C default.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# Keep the serial output useful while the project is still boilerplate.
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# BLE GATT server for the phone app. Keep classic BT disabled to reduce memory use.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_CLASSIC_ENABLED=n
CONFIG_BTDM_CTRL_MODE_BLE_ONLY=y
CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=n
CONFIG_BTDM_CTRL_MODE_BTDM=n
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=n
CONFIG_BT_BTC_TASK_STACK_SIZE=15000
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y
